<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xml:lang="en" xmlns="http://www.w3.org/1999/xhtml" lang="en">
<head>
   
  <meta content="text/html; charset=ISO-8859-1"
 http-equiv="Content-Type">
   
  <meta
 content="GAP system for computational discrete algebra, especially computational group theory"
 name="Description">
   
  <meta
 content="GAP,group theory,computational group theory,algebra,computational algebra,computational discrete algebra,mathematical computation"
 name="Keywords">
  <title>GAP Installation on Macintosh (MacOS)</title>
</head>
  <body>
 
<h2 align="justify">&#1048;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1103; GAP &#1076;&#1083;&#1103; Macintosh (MacOS)</h2>
 
<div align="justify"> </div>
 
<p align="justify">&#1044;&#1083;&#1103; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1080; GAP &#1076;&#1083;&#1103; Macintosh &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100;
&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1080;&#1078;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; (&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; Mac OS X &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; <a
 href="UNIXInst.htm">UNIX</a>-&#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1102; &#1076;&#1083;&#1103; &#1087;&#1086;&#1074;&#1099;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;
&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1087;&#1086;&#1083;&#1085;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074;&#1089;&#1077;&#1093; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;). &#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1042;&#1099;
&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1083;&#1080; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099; <b>gap4r4p9.zoo</b> &#1080; <b>packages-....zoo</b> (&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <b>&#1090;&#1086;&#1083;&#1100;&#1082;&#1086;</b>&nbsp;<b>zoo-&#1072;&#1088;&#1093;&#1080;&#1074;</b>, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099;
&#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1080;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1076;&#1083;&#1103; MacOS), &#1080; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1082;&#1072;&#1082; &#1080;&#1093; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077;
&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1083;&#1080; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1091; <b><code>unzoo</code></b>.<br>
 </p>
 
<p align="justify"></p>
 
<div align="justify"> 
<ul>
   <li>     
    <p>&#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074; <code>unzoo4r4-...sit</code> (&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,
Stuffit Expander). &#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; <code>unzoo
4r4 ...</code>. </p>
   </li>
   <li>     
    <p>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074; <code>gap4r4p9.zoo</code> &#1080; <code>unzoo 4r4</code> 
&#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; GAP. &#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074;, &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1074;
    <code>gap4r4p9.zoo</code> &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; <code>unzoo</code>. 
&#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; <code>gap4r4</code>. &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077;
&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; <code>GAP 4 ...</code> &nbsp;&#1074; &#1101;&#1090;&#1086;&#1090; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;. </p>
   </li>
   <li>     
    <p>&#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1080;&#1079; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072; packages-... &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; ( ! ) &#1087;&#1086;&#1076;&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;
    <code>pkg</code> &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072; <code>gap4r4</code>. &#1047;&#1072;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1074; MacOS, &#1080;&#1083;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;.&nbsp;<br>
     </p>
   </li>
   <li>     
    <p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1096;&#1077;&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1096;&#1072;&#1075;&#1086;&#1074; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1090;&#1100; &#1096;&#1072;&#1075;&#1080;,
&#1085;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1097;&#1080;&#1077; &#1086;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;
&#1086;&#1073; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1080; &#1074; GAP Group.<!-- Created by mixer. --><!-- Created by mixer. -->
    </p>
   </li>
 
</ul>
 </div>
 <br>
 <br>
</body>
</html>
