<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xml:lang="en" xmlns="http://www.w3.org/1999/xhtml" lang="en">
<head>
   
  <meta content="text/html; charset=ISO-8859-1"
 http-equiv="Content-Type">
   
  <meta
 content="GAP system for computational discrete algebra, especially computational group theory"
 name="Description">
   
  <meta
 content="GAP,group theory,computational group theory,algebra,computational algebra,computational discrete algebra,mathematical computation"
 name="Keywords">
  <title>GAP Installation on UNIX</title>
</head>
  <body>
 
<div align="justify"><!--<tr>
<td colspan="2"><mixer func="maketop"/></td>
</tr>-->
</div>
 
<h2 align="justify">&#1048;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1103; GAP &#1076;&#1083;&#1103; UNIX (&#1074; &#1090;.&#1095;. Linux &#1080; Mac OS X)</h2>
 
<div align="justify"> </div>
 
<p align="justify">&#1044;&#1083;&#1103; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1080; GAP &#1076;&#1083;&#1103; UNIX/Linux &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100;
&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1080;&#1078;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; (&#1076;&#1083;&#1103; Mac OS X &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1096;&#1072;&#1075;&#1086;&#1074; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;
&#1090;&#1072; &#1078;&#1077;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1085;&#1080;&#1078;&#1077; <a
 href="UNIXInst.htm#osx">&#1079;&#1072;&#1084;&#1077;&#1090;&#1082;&#1072;&#1084;&#1080; &#1087;&#1086; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; OS&nbsp;X</a>. <br>
 </p>
 
<p align="justify">&#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; C-&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;,
&#1042;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1083;&#1080; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099; <code>gap4r4p9</code> &#1080; <code>packages-...</code>, &#1080;
&#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1082;&#1072;&#1082; &#1080;&#1093; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100;. </p>
 
<div align="justify"> 
<ul>
   <li>     
    <p>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <code>/usr/local/lib</code> 
(&#1080;&#1083;&#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1083;&#1080;&#1095;&#1085;&#1099;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1085;&#1077; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1072;&#1084;&#1080; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072;
&#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077;). &#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074; <code>gap4r4p9</code> &#1074; &#1101;&#1090;&#1086;&#1090; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;.
&#1069;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1089;&#1090; &#1087;&#1086;&#1076;&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; <code>gap4r4</code>, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1099; &#1074; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1077;&#1084; &#1073;&#1091;&#1076;&#1077;&#1084;
&#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; &#1085;&#1072; <code>$GAPROOT</code>. </p>
     
    <p> <strong>&#1054;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;:</strong> &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1083;&#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1088;&#1093;&#1080;&#1074;
    <code>xtom1r1p2</code>, &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1042;&#1099;
&#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1099;&#1074;&#1072;&#1083;&#1080; &#1072;&#1088;&#1093;&#1080;&#1074; <code>gap4r4p9</code>. </p>
   </li>
   <li>     
    <p>&#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1080;&#1079; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072; <code>packages-...</code> <b>&#1074;&#1085;&#1091;&#1090;&#1088;&#1080; (
! )</b> &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072; <code>$GAPROOT/pkg</code>. </p>
   </li>
   <li>     
    <p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1091;&#1078;&#1085;&#1086; &#1086;&#1090;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1103;&#1076;&#1088;&#1086; GAP &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; ANSI C-&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;&#1072;
(&#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; <a href="http://gcc.gnu.org/">gcc</a>, &#1077;&#1089;&#1083;&#1080;
&#1101;&#1090;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;). &#1042; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1081;
&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;: </p>
     
    <pre>     cd $GAPROOT<br>     ./configure<br>     make<br></pre>
     
    <p> </p>
     
    <p> <strong>&#1054;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;:</strong> &#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1078;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; C-&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;,
&#1086;&#1087;&#1094;&#1080;&#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;&#1072; &#1080;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1097;&#1080;&#1082;&#1072;, &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;
&#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; <code>CC</code>, <code>COPTS</code> &#1080;&#1083;&#1080;     <code>LOPTS</code>,
&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1087;&#1077;&#1088;&#1077;&#1076; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; <code>configure</code>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;
SUN Solaris &#1076;&#1083;&#1103; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1077;&#1077; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;&#1072; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; 64-&#1073;&#1080;&#1090;&#1085;&#1086;&#1075;&#1086;
&#1082;&#1086;&#1076;&#1072; &#1074; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1080;&#1084;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077;
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; (&#1074; csh-&#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;&#1077;): </p>
     
    <pre>    setenv CC cc<br>    setenv COPTS "-v9a -fast"<br>    setenv LOPTS -static<br>    ./configure<br>    make<br></pre>
   </li>
   <li>     
    <p>&#1057;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; <code>GAPROOT/bin/gap.sh</code> &#1074; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093;
&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1080;&#1084;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1074; &#1042;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; <code>/usr/local/bin</code>).
&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1087;&#1094;&#1080;&#1080;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1101;&#1090;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077;, &#1080; &#1076;&#1083;&#1103; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1072;
&#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082; &#1085;&#1077;&#1084;&#1091; &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1074; <code>gap</code>. </p>
   </li>
   <li>     
    <p>&#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;
&#1073;&#1099;&#1090;&#1100; &#1086;&#1090;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1072;&#1082;&#1077;&#1090;&#1072;.
&#1057;&#1082;&#1088;&#1080;&#1087;&#1090; <a href="http://www.gap-system.org/Download/InstPackages.sh"><code>InstPackages.sh</code></a> 
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;, &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1099;&#1093; &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077;
&#1074;&#1088;&#1077;&#1084;&#1103;, &#1087;&#1088;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;, &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1074;
&#1080; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; &#1080;&#1083;&#1080; &#1078;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086;
&#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1074;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1085;&#1077; &#1089;&#1084;&#1086;&#1075;&#1091;&#1090; 
&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084; <code>README</code> &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;.
    </p>
   </li>
   <li>     
    <p> <strong>&#1054;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;:</strong> GAP &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;
&#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; <i>&#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;</i>. &#1056;&#1072;&#1073;&#1086;&#1095;&#1077;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090;
&#1073;&#1099;&#1090;&#1100; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1086; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089;&#1086; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1084; <a
 href="http://www.gap-system.org/Download/CreateWorkspace.sh"><code>CreateWorkspace.sh</code></a>. 
    </p>
   </li>
   <li>     
    <p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1096;&#1077;&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1096;&#1072;&#1075;&#1086;&#1074; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1090;&#1100; &#1096;&#1072;&#1075;&#1080;,
&#1085;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1097;&#1080;&#1077; &#1086;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;
&#1086;&#1073; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1080; &#1074; GAP Group. </p>
   </li>
 
</ul>
 </div>
 
<h3 align="justify">&#1057;&#1077;&#1090;&#1077;&#1074;&#1072;&#1103; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1103;</h3>
 
<div align="justify"> </div>
 
<p align="justify">&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; GAP &#1085;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077; &#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1077;&#1077; 
&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1081; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1082; &#1085;&#1077;&#1084;&#1091; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074; &#1089; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1086;&#1081; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081;. &#1044;&#1083;&#1103; 
&#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1091; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1080;&#1079; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088; 
(&#1087;&#1088;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1085;&#1086;&#1074;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; <code>make 
clean</code> &#1076;&#1083;&#1103; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1075;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; <code>./configure</code>). 
&#1048;&#1089;&#1087;&#1086;&#1083;&#1085;&#1080;&#1084;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1087;&#1086;&#1076;&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;&#1093;, &#1080; &#1042;&#1072;&#1084; &#1086;&#1089;&#1090;&#1072;&#1085;&#1077;&#1090;&#1089;&#1103; 
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1087;&#1091;&#1090;&#1100; &#1082; &#1085;&#1080;&#1084; &#1074; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1072;&#1093; &#1076;&#1083;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1099;.<code><font
 face="Times New Roman, Times, serif"></font></code> </p>
 
<div align="justify"> </div>
 
<h2 align="justify">&#1047;&#1072;&#1084;&#1077;&#1090;&#1082;&#1080; &#1087;&#1086; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; OS X<a name="osx"></a></h2>
 
<div align="justify"> </div>
 
<p align="justify">&#1053;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; GAP &#1076;&#1083;&#1103; Mac 
OS &#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;, &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100; 
Unix-&#1074;&#1077;&#1088;&#1089;&#1080;&#1102;: &#1086;&#1085;&#1072; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081;, &#1085;&#1086; &#1080; &#1076;&#1072;&#1089;&#1090; &#1042;&#1072;&#1084; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; 
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099;. </p>
 
<div align="justify"> </div>
 
<p align="justify">&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1077;&#1097;&#1077; &#1085;&#1077; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1074; OS X, &#1090;&#1086;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, 
&#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1090;&#1089;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;&#1072;. &#1057;&#1086;&#1074;&#1077;&#1090;&#1099; &#1087;&#1086; &#1077;&#1075;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1089;&#1103; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;
<a href="http://www.math.colostate.edu/%7Ehulpke/osx/gaposx.html">http://www.math.colostate.edu/~hulpke/osx/gaposx.html</a> 
. </p>
 
<div align="justify"> </div>
 
<p align="justify">&#1044;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; GAP &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100; &#1058;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;, 
&#1074; &#1086;&#1082;&#1085;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1042;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; Unix. &#1058;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1081;&#1076;&#1077;&#1090; 
&#1074; &#1087;&#1086;&#1076;&#1084;&#1077;&#1085;&#1102; "&#1059;&#1090;&#1080;&#1083;&#1080;&#1090;&#1099;" &#1084;&#1077;&#1085;&#1102; "&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;". GAP &#1090;&#1072;&#1082;&#1078;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1086;&#1082;&#1085;&#1077; 
&#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1072;. </p>
 
<div align="justify"> </div>
 
<p align="justify">&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1080; Unix-&#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1085;&#1091;&#1078;&#1085;&#1086; 
&#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100; Unix-&#1072;&#1088;&#1093;&#1080;&#1074;&#1099; (&#1090;.&#1077;. <b>tar</b> &#1080;&#1083;&#1080; <b>zoo</b>, &#1080; <u>&#1085;&#1080; &#1074; &#1082;&#1086;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; 
&#1085;&#1077; <b>zip</b> archive</u>), &#1080;, &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; zoo-&#1072;&#1088;&#1093;&#1080;&#1074;&#1072;, &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; 
<b>Unix-&#1074;&#1077;&#1088;&#1089;&#1080;&#1102; unzoo</b> (&#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; unzoo &#1076;&#1083;&#1103; Macintosh, 
&#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1099; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; MacOS, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;&#1084; 
&#1089; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1077;&#1081;). </p>
 
<div align="justify"> </div>
 
<p align="justify">&#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; (&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <tt><b>cd</b></tt> &#1074; &#1086;&#1082;&#1085;&#1077; 
&#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1072;) &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; GAP, &#1080; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; 
&#1074; &#1085;&#1077;&#1075;&#1086; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099; &#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; <b>unzoo</b>, &#1077;&#1089;&#1083;&#1080; &#1042;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; zoo-&#1072;&#1088;&#1093;&#1080;&#1074;&#1099;. 
&#1047;&#1072;&#1090;&#1077;&#1084;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1074;&#1080;&#1076;&#1072; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;, &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;&nbsp; 
</p>
 
<div align="justify"> 
<pre>    tar zxvf gap4r4p9.tar.gz<br></pre>
 </div>
 
<p align="justify">&#1080;&#1083;&#1080;&nbsp;</p>
 
<div align="justify"> 
<pre>    gcc -o unzoo -DSYS_IS_UNIX -O unzoo.c<br>    ./unzoo -x gap4r4p9.zoo<br></pre>
 </div>
 
<p align="justify">&#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1081;&#1090;&#1077; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1102; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1081; 
&#1074;&#1099;&#1096;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1077;&#1081; &#1076;&#1083;&#1103; Unix.</p>
 <br>
</body>
</html>
