<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xml:lang="en" xmlns="http://www.w3.org/1999/xhtml" lang="en">
<head>
   
  <meta content="text/html; charset=ISO-8859-1"
 http-equiv="Content-Type">
   
  <link href="../lib/gw.css" type="text/css" rel="StyleSheet">
   
  <meta
 content="GAP,group theory,computational group theory,algebra,computational algebra,computational discrete algebra,mathematical computation"
 name="Keywords">
  <title>GAP Installation on Windows</title>
</head>
  <body>
 
<div align="justify"><!--<tr>
<td colspan="2"><mixer func="maketop"/></td>
</tr>-->
</div>
 
<h2 align="justify">&#1048;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1103; GAP &#1076;&#1083;&#1103; Windows</h2>
 
<div align="justify"> </div>
 
<p align="justify">&#1044;&#1083;&#1103; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1080; GAP &#1076;&#1083;&#1103; Windows &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; 
&#1085;&#1080;&#1078;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; (&#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1042;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1083;&#1080; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099; gap4r4p9 &#1080; packages-..., 
&#1080; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1082;&#1072;&#1082; &#1080;&#1093; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100;). </p>
 
<div align="justify"> 
<ul>
   <li>     
    <p>&#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074; <code>gap4r4p9</code> &#1074; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1076;&#1080;&#1089;&#1082;&#1072;  
  <code>C:\</code>. &#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1089;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; <code>C:\gap4r4</code>.
    </p>
     
    <p> <strong>&#1054;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;:</strong> &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1083;&#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1088;&#1093;&#1080;&#1074; 
xtom1r1p2, &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1042;&#1099; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1099;&#1074;&#1072;&#1083;&#1080; &#1072;&#1088;&#1093;&#1080;&#1074; 
gap4r4p3.&nbsp; </p>
   </li>
   <li>     
    <p>&#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1080;&#1079; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072; packages-... &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; ( ! ) &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;&nbsp;<i></i><code>C:\GAP4r4\pkg\</code>. 
&#1047;&#1072;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1074; Windows, &#1080;&#1083;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; 
&#1089; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;. </p>
   </li>
   <li>     
    <p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; GAP &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1092;&#1072;&#1081;&#1083;&#1072; <code>C:\gap4r4\bin\gap.bat</code>. 
&#1044;&#1083;&#1103; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1072; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1103;&#1088;&#1083;&#1099;&#1082;&#1080;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072; &#1101;&#1090;&#1086;&#1090; &#1092;&#1072;&#1081;&#1083;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 
&#1074; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1084; &#1084;&#1077;&#1085;&#1102; &#1080; &#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1084; &#1089;&#1090;&#1086;&#1083;&#1077;. </p>
   </li>
   <li>     
    <p> <strong>&#1054;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;:</strong> &#1041;&#1086;&#1083;&#1077;&#1077; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;, 
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1086;&#1073;&#1086;&#1083;&#1086;&#1095;&#1082;&#1091; <a href="http://www.rxvt.org">rxvt</a>. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; 
&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100; GAP &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1092;&#1072;&#1081;&#1083;&#1072; <code>C:\gap4r4\bin\gaprxvt.bat</code>. &#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; 
&#1091;&#1095;&#1077;&#1089;&#1090;&#1100;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1095;&#1090;&#1086; GAP Group &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1081; &#1086;&#1073;&#1086;&#1083;&#1086;&#1095;&#1082;&#1080;.
    </p>
   </li>
   <li>     
    <p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1096;&#1077;&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1096;&#1072;&#1075;&#1086;&#1074; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1090;&#1100; &#1096;&#1072;&#1075;&#1080;, 
&#1085;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1097;&#1080;&#1077; &#1086;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; 
&#1086;&#1073; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1080; &#1074; GAP Group.&nbsp; </p>
   </li>
 
</ul>
 </div>
 
<h3 align="justify">&#1048;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1103; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077;</h3>
 
<div align="justify"> </div>
 
<p align="justify"> GAP &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077;, &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086;&#1084; 
&#1086;&#1090; <code>C:\GAP4r4\pkg\</code>. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1091;&#1090;&#1080; 
&#1074; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; <code>gap4r4</code><code>\bin\gap.bat</code> <code></code>&#1080; <code>gap4r4\bin\gaprxvt.bat</code>. 
</p>
 
<div align="justify"> </div>
 
<h3 align="justify">&#1059;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;</h3>
 
<div align="justify"> </div>
 
<p align="justify">&#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1072;&#1103; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; <b>cygwin</b> &#1085;&#1077; 
&#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1095;&#1077;&#1084; 128 &#1052;&#1073; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;&#1102;. &#1044;&#1083;&#1103; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1075;&#1081;
&#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1085;&#1091;&#1078;&#1085;&#1086; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; Windows. </p>
 
<div align="justify"> </div>
 
<p align="justify"><b> *&#1042;&#1053;&#1048;&#1052;&#1040;&#1053;&#1048;&#1045;:*</b> &#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&#1072; Windows &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; 
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1089; &#1086;&#1089;&#1086;&#1073;&#1086;&#1081; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;. &#1045;&#1075;&#1086; &#1085;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1091; &#1042;&#1072;&#1089; 
&#1085;&#1077;&#1090; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1086;&#1087;&#1099;&#1090;&#1072;. &#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1086;&#1074;&#1077;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1099; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="http://www.cygwin.com/cygwin-ug-net/setup-maxmem.html">www.cygwin.com/cygwin-ug-net/setup-maxmem.html</a>. 
</p>
 
<div align="justify"> </div>
 
<p align="justify">&#1055;&#1077;&#1088;&#1077;&#1076; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; GAP
&#1093;&#1086;&#1090;&#1103; &#1073;&#1099; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081;. </p>
 
<div align="justify"> </div>
 
<p align="justify">&#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; <tt>usemem.bat</tt> 
&#1080;&#1079; &#1087;&#1086;&#1076;&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072; <tt>bin</tt>i, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1080;&#1090; &#1082;&#1083;&#1102;&#1095;&#1091;&nbsp; </p>
 
<div align="justify"> 
<pre><b>/HKEY_LOCAL_MACHINE/Software/Cygnus Solutions/Cygwin/heap_chunk_in_mb</b><br></pre>
 </div>
 
<p align="justify">&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>1024</b>. </p>
 
<div align="justify"> </div>
 
<p align="justify">&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;, &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; 
<b>regedit</b> &#1080; &#1085;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074;&#1099;&#1096;&#1077; &#1082;&#1083;&#1102;&#1095; <b>Cygwin</b>. &#1047;&#1072;&#1090;&#1077;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; 
&#1085;&#1086;&#1074;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>heap_chunk_in_mb</b> &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>1024</b>.</p>
 <br>
</body>
</html>
